In [1]:
import pandas as pd
import numpy as np

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,'avocado'])

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA

In [10]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [14]:
cleaned = data.dropna()

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = NA

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.randn(7, 3))

In [22]:
df.iloc[:4, 1] = NA

In [23]:
df.iloc[:2, 2] = NA

In [24]:
df

          0         1         2
0 -0.031909       NaN       NaN
1  0.903131       NaN       NaN
2  1.190116       NaN  0.539298
3 -0.369092       NaN  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [25]:
df.dropna()

          0         1         2
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [26]:
df.dropna(thresh=2)

          0         1         2
2  1.190116       NaN  0.539298
3 -0.369092       NaN  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [27]:
df.fillna(0)

          0         1         2
0 -0.031909  0.000000  0.000000
1  0.903131  0.000000  0.000000
2  1.190116  0.000000  0.539298
3 -0.369092  0.000000  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [28]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.031909  0.500000  0.000000
1  0.903131  0.500000  0.000000
2  1.190116  0.500000  0.539298
3 -0.369092  0.500000  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [29]:
_ = df.fillna(0, inplace=True)

In [30]:
df

          0         1         2
0 -0.031909  0.000000  0.000000
1  0.903131  0.000000  0.000000
2  1.190116  0.000000  0.539298
3 -0.369092  0.000000  0.626892
4 -0.167360 -0.584843  1.435983
5  0.432487  0.808849 -0.949284
6  0.354613 -1.211243  0.295401

In [31]:
df = pd.DataFrame(np.random.randn(6, 3))

In [32]:
df.iloc[2:, 1] = NA

In [33]:
df.iloc[4:, 2] = NA

In [34]:
df

          0         1         2
0  0.315981  0.097579  0.859430
1 -0.759017  0.958380  0.941447
2  0.950923       NaN  1.446146
3 -1.897742       NaN -0.987770
4 -0.646025       NaN       NaN
5 -1.372841       NaN       NaN

In [35]:
df.fillna(method='ffill')

          0         1         2
0  0.315981  0.097579  0.859430
1 -0.759017  0.958380  0.941447
2  0.950923  0.958380  1.446146
3 -1.897742  0.958380 -0.987770
4 -0.646025  0.958380 -0.987770
5 -1.372841  0.958380 -0.987770

In [36]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.315981  0.097579  0.859430
1 -0.759017  0.958380  0.941447
2  0.950923  0.958380  1.446146
3 -1.897742  0.958380 -0.987770
4 -0.646025       NaN -0.987770
5 -1.372841       NaN -0.987770

In [37]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [38]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [29]:
data=pd.DataFrame({"food":["bacon","pulled pork","bacon","Pastrami","corned beef","Bacon","pastrami","honey ham","nova lox"],
                    "ounces":[4, 3, 12, 6, 7.5, 8, 3, 5,6]})

In [30]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [32]:
lowercased = data['food'].str.lower()

In [33]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [34]:
data['animal'] = lowercased.map(meat_to_animal)

In [35]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [36]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [37]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [38]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [43]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=['Ohio', 'Colorado', 'New York'],
   ....:                     columns=['one', 'two', 'three', 'four'])

In [44]:
transform = lambda x: x[:4].upper()

In [47]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [49]:
data.index = data.index.map(transform)

In [50]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'},
   ....:             columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [52]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [53]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [54]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [55]:
bins = [18, 25, 35, 60, 100]

In [56]:
cats = pd.cut(ages, bins)

In [57]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [58]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [59]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [60]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [61]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [62]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged',
'Senior']

In [63]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [64]:
data = np.random.rand(20)

In [65]:
pd.cut(data, 4, precision=2)

[(0.71, 0.93], (0.48, 0.71], (0.71, 0.93], (0.26, 0.48], (0.034, 0.26], ..., (0.71, 0.93], (0.71, 0.93], (0.71, 0.93], (0.48, 0.71], (0.034, 0.26]]
Length: 20
Categories (4, interval[float64]): [(0.034, 0.26] < (0.26, 0.48] < (0.48, 0.71] < (0.71, 0.93]]

In [66]:
data = np.random.randn(1000)

In [67]:
cats = pd.qcut(data, 4)

In [68]:
cats

[(0.708, 3.146], (0.708, 3.146], (-0.646, 0.0572], (-2.927, -0.646], (-2.927, -0.646], ..., (-0.646, 0.0572], (-0.646, 0.0572], (0.708, 3.146], (0.708, 3.146], (-0.646, 0.0572]]
Length: 1000
Categories (4, interval[float64]): [(-2.927, -0.646] < (-0.646, 0.0572] < (0.0572, 0.708] < (0.708, 3.146]]

In [69]:
pd.value_counts(cats)

(0.708, 3.146]      250
(0.0572, 0.708]     250
(-0.646, 0.0572]    250
(-2.927, -0.646]    250
dtype: int64

In [70]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0572, 1.333], (1.333, 3.146], (-1.234, 0.0572], (-1.234, 0.0572], (-1.234, 0.0572], ..., (-1.234, 0.0572], (-1.234, 0.0572], (1.333, 3.146], (0.0572, 1.333], (-1.234, 0.0572]]
Length: 1000
Categories (4, interval[float64]): [(-2.927, -1.234] < (-1.234, 0.0572] < (0.0572, 1.333] < (1.333, 3.146]]

In [71]:
 data = pd.DataFrame(np.random.randn(1000, 4))

In [73]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.000302    -0.030077    -0.045250    -0.014394
std       1.000537     0.994265     1.010387     0.963676
min      -3.876842    -3.266495    -2.863720    -2.762742
25%      -0.700453    -0.706066    -0.687200    -0.669664
50%      -0.001602    -0.023262    -0.066336    -0.015743
75%       0.671718     0.656693     0.626736     0.660879
max       2.851898     3.517922     3.821793     2.698349

In [74]:
col = data[2]

In [75]:
col[np.abs(col) > 3]

322    3.079615
438    3.821793
Name: 2, dtype: float64

In [76]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
224 -1.807005  3.517922  2.291560 -0.311966
322 -2.495430  0.482978  3.079615  0.621722
438 -0.166039  1.250840  3.821793  1.753052
459 -3.876842  1.935448  0.048997 -0.250687
700 -0.531101 -3.266495 -1.433070  1.058886
815 -0.382346  3.393664  0.428972  0.267778

In [77]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [78]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.001179    -0.030722    -0.046151    -0.014394
std       0.997516     0.990431     1.007324     0.963676
min      -3.000000    -3.000000    -2.863720    -2.762742
25%      -0.700453    -0.706066    -0.687200    -0.669664
50%      -0.001602    -0.023262    -0.066336    -0.015743
75%       0.671718     0.656693     0.626736     0.660879
max       2.851898     3.000000     3.000000     2.698349

In [79]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0  1.0 -1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0  1.0 -1.0

In [80]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [81]:
sampler = np.random.permutation(5)

In [82]:
sampler

array([3, 2, 1, 0, 4])

In [83]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [84]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [85]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3

In [86]:
choices = pd.Series([5, 7, -1, 6, 4])

In [87]:
draws = choices.sample(n=10, replace=True)

In [88]:
draws

0    5
3    6
0    5
1    7
1    7
1    7
3    6
4    4
3    6
4    4
dtype: int64

In [89]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
   .....:                    'data1': range(6)})

In [90]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [91]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [92]:
df_with_dummy = df[['data1']].join(dummies)

In [93]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [94]:
mnames = ['movie_id', 'title', 'genres']

In [104]:
movies = pd.read_table('datasets/movielens/movies.dat',sep='::',header=None, names=mnames)

/Users/sunyihuan/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [105]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [106]:
all_genres = []

In [108]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [109]:
genres = pd.unique(all_genres)

In [110]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [111]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [112]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [113]:
gen = movies.genres[0]

In [114]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [115]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [116]:
for i, gen in enumerate(movies.genres):

SyntaxError: unexpected EOF while parsing (<ipython-input-116-80ce80d45955>, line 1)

In [117]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [118]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [119]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [120]:
np.random.seed(12345)

In [121]:
values = np.random.rand(10)

In [122]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [123]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [124]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [125]:
val = 'a,b,  guido'

In [126]:
val.split(',')

['a', 'b', '  guido']

In [127]:
pieces = [x.strip() for x in val.split(',')]

In [128]:
pieces

['a', 'b', 'guido']

In [129]:
first, second, third = pieces

In [130]:
first + '::' + second + '::' + third

'a::b::guido'

In [131]:
'::'.join(pieces)

'a::b::guido'

In [132]:
'guido' in val

True

In [133]:
val.index(',')

1

In [134]:
val.find(':')

-1

In [135]:
val.index(':')

ValueError: substring not found

In [136]:
val.count(',')

2

In [137]:
val.replace(',', '::')

'a::b::  guido'

In [138]:
val.replace(',', '')

'ab  guido'

In [139]:
import re

In [140]:
text = "foo    bar\t baz  \tqux"

In [141]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [142]:
regex = re.compile('\s+')

In [143]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [144]:
regex.findall(text)

['    ', '\t ', '  \t']

In [145]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [146]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [147]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [148]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [149]:
m = regex.search(text)

In [150]:
m

In [151]:
text[m.start():m.end()]

'dave@google.com'

In [152]:
print(regex.match(text))

None

In [153]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [154]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [155]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [156]:
m = regex.match('wesm@bright.net')

In [157]:
m.groups()

('wesm', 'bright', 'net')

In [158]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [159]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',
text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [161]:
data = {'Dave': 'dave@google.com', 'Steve':
'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [162]:
data = pd.Series(data)

In [163]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [164]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [165]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [166]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [167]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [169]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [170]:
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

matches.str.get(1)

In [171]:
matches.str[0]

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [172]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object